var rule = {
author: '小可乐/2409/第一版',
title: '555app',
类型: '影视',
//host: 'https://wuj6h9g3.com',
host: 'https://5moviehub.com',
hostJs: 'let kcode=atob(pdfh(request(HOST),"body&&#domainData&&data-info"));let khost=JSON.parse(kcode).site_main;if(!khost.startsWith("http")){khost="https://"+khost};HOST=khost',
headers: {'User-Agent': 'MOBILE_UA'},
编码: 'utf-8',
timeout: 5000,

homeUrl: '/api.php/app/index_video',
url: '/api.php/app/video?tid=fyfilter&pg=fypage&limit=20',
filter_url: '{{fl.cateId}}&{{fl.class}}&{{fl.area}}&{{fl.lang}}&{{fl.year}}',
detailUrl: '/api.php/app/video_detail?id=fyid',
searchUrl: '/api.php/app/search?text=**&pg=fypage',
searchable: 1, 
quickSearch: 1, 
filterable: 1, 

class_name: '电影&剧集&综艺&动漫&福利',
class_url: '1&2&3&4&124',
filter_def: {
1: {cateId: '1'},
2: {cateId: '2'},
3: {cateId: '3'},
4: {cateId: '4'},
124: {cateId: '124'}
},

tab_remove: ['ddvip'],
play_parse: true,
lazy: `js:
if (/\\.(m3u8|mp4)/.test(input)) {
    input = { jx: 0, parse: 0, url: input }
} else {
    input = { jx: 0, parse: 1, url: input }
}
`,

limit: 9,
double: true,
推荐: 'json:list;vlist;*;*;*;*',
一级: 'json:list;vod_name;vod_pic;vod_remarks;vod_id',
二级: `js:
let kdata = JSON.parse(request(input)).data;
VOD = kdata;
VOD.type_name = kdata.vod_class
`,
搜索: '*',

filter: {
"1":[
{"key":"class","name":"剧情","value":[{"n":"全部","v":""},{"n":"Netflix","v":"class=Netflix"},{"n":"仙侠","v":"class=仙侠"},{"n":"剧情","v":"class=剧情"},{"n":"科幻","v":"class=科幻"},{"n":"动作","v":"class=动作"},{"n":"喜剧","v":"class=喜剧"},{"n":"爱情","v":"class=爱情"},{"n":"冒险","v":"class=冒险"},{"n":"儿童","v":"class=儿童"},{"n":"歌舞","v":"class=歌舞"},{"n":"音乐","v":"class=音乐"},{"n":"奇幻","v":"class=奇幻"},{"n":"动画","v":"class=动画"},{"n":"恐怖","v":"class=恐怖"},{"n":"惊悚","v":"class=惊悚"},{"n":"丧尸","v":"class=丧尸"},{"n":"战争","v":"class=战争"},{"n":"传记","v":"class=传记"},{"n":"纪录","v":"class=纪录"},{"n":"犯罪","v":"class=犯罪"},{"n":"悬疑","v":"class=悬疑"},{"n":"西部","v":"class=西部"},{"n":"灾难","v":"class=灾难"},{"n":"古装","v":"class=古装"},{"n":"武侠","v":"class=武侠"},{"n":"家庭","v":"class=家庭"},{"n":"短片","v":"class=短片"},{"n":"校园","v":"class=校园"},{"n":"文艺","v":"class=文艺"},{"n":"运动","v":"class=运动"},{"n":"青春","v":"class=青春"},{"n":"同性","v":"class=同性"},{"n":"励志","v":"class=励志"},{"n":"人性","v":"class=人性"},{"n":"美食","v":"class=美食"},{"n":"女性","v":"class=女性"},{"n":"治愈","v":"class=治愈"},{"n":"历史","v":"class=历史"},{"n":"真人秀","v":"class=真人秀"},{"n":"脱口秀","v":"class=脱口秀"}]},
{"key":"area","name":"地区","value":[{"n":"全部","v":""},{"n":"大陆","v":"area=大陆"},{"n":"香港","v":"area=香港"},{"n":"台湾","v":"area=台湾"},{"n":"美国","v":"area=美国"},{"n":"日本","v":"area=日本"},{"n":"韩国","v":"area=韩国"},{"n":"英国","v":"area=英国"},{"n":"法国","v":"area=法国"},{"n":"德国","v":"area=德国"},{"n":"印度","v":"area=印度"},{"n":"泰国","v":"area=泰国"},{"n":"丹麦","v":"area=丹麦"},{"n":"瑞典","v":"area=瑞典"},{"n":"巴西","v":"area=巴西"},{"n":"加拿大","v":"area=加拿大"},{"n":"俄罗斯","v":"area=俄罗斯"},{"n":"意大利","v":"area=意大利"},{"n":"比利时","v":"area=比利时"},{"n":"爱尔兰","v":"area=爱尔兰"},{"n":"西班牙","v":"area=西班牙"},{"n":"澳大利亚","v":"area=澳大利亚"}]},
{"key":"lang","name":"语言","value":[{"n":"全部","v":""},{"n":"英语","v":"lang=英语"},{"n":"法语","v":"lang=法语"},{"n":"国语","v":"lang=国语"},{"n":"粤语","v":"lang=粤语"},{"n":"日语","v":"lang=日语"},{"n":"韩语","v":"lang=韩语"},{"n":"泰语","v":"lang=泰语"},{"n":"德语","v":"lang=德语"},{"n":"俄语","v":"lang=俄语"},{"n":"闽南语","v":"lang=闽南语"},{"n":"丹麦语","v":"lang=丹麦语"},{"n":"波兰语","v":"lang=波兰语"},{"n":"瑞典语","v":"lang=瑞典语"},{"n":"印地语","v":"lang=印地语"},{"n":"挪威语","v":"lang=挪威语"},{"n":"意大利语","v":"lang=意大利语"},{"n":"西班牙语","v":"lang=西班牙语"}]},
{"key":"year","name":"年份","value":[{"n":"全部","v":""},{"n":"2024","v":"year=2024"},{"n":"2023","v":"year=2023"},{"n":"2022","v":"year=2022"},{"n":"2021","v":"year=2021"},{"n":"2020","v":"year=2020"},{"n":"2019","v":"year=2019"},{"n":"2018","v":"year=2018"},{"n":"2017","v":"year=2017"},{"n":"2016","v":"year=2016"},{"n":"2015","v":"year=2015"},{"n":"2014","v":"year=2014"},{"n":"2013","v":"year=2013"},{"n":"2012","v":"year=2012"},{"n":"2011","v":"year=2011"},{"n":"2010","v":"year=2010"},{"n":"2009","v":"year=2009"},{"n":"2008","v":"year=2008"},{"n":"2007","v":"year=2007"}]}
],
"2":[
{"key":"cateId","name":"类型","value":[{"n":"全部","v":"2"},{"n":"热门连续剧","v":"13"},{"n":"港台剧","v":"15"},{"n":"日韩剧","v":"44"},{"n":"欧美剧","v":"45"}]},
{"key":"class","name":"剧情","value":[{"n":"全部","v":""},{"n":"Netflix","v":"class=Netflix"},{"n":"短剧","v":"class=短剧"},{"n":"剧情","v":"class=剧情"},{"n":"丧尸","v":"class=丧尸"},{"n":"仙侠","v":"class=仙侠"},{"n":"穿越","v":"class=穿越"},{"n":"惊悚","v":"class=惊悚"},{"n":"恐怖","v":"class=恐怖"},{"n":"言情","v":"class=言情"},{"n":"科幻","v":"class=科幻"},{"n":"动作","v":"class=动作"},{"n":"喜剧","v":"class=喜剧"},{"n":"爱情","v":"class=爱情"},{"n":"偶像","v":"class=偶像"},{"n":"都市","v":"class=都市"},{"n":"军旅","v":"class=军旅"},{"n":"谍战","v":"class=谍战"},{"n":"罪案","v":"class=罪案"},{"n":"宫廷","v":"class=宫廷"},{"n":"冒险","v":"class=冒险"},{"n":"儿童","v":"class=儿童"},{"n":"歌舞","v":"class=歌舞"},{"n":"音乐","v":"class=音乐"},{"n":"奇幻","v":"class=奇幻"},{"n":"动画","v":"class=动画"},{"n":"战争","v":"class=战争"},{"n":"传记","v":"class=传记"},{"n":"记录","v":"class=记录"},{"n":"犯罪","v":"class=犯罪"},{"n":"悬疑","v":"class=悬疑"},{"n":"西部","v":"class=西部"},{"n":"灾难","v":"class=灾难"},{"n":"古装","v":"class=古装"},{"n":"武侠","v":"class=武侠"},{"n":"家庭","v":"class=家庭"},{"n":"短片","v":"class=短片"},{"n":"校园","v":"class=校园"},{"n":"文艺","v":"class=文艺"},{"n":"运动","v":"class=运动"},{"n":"青春","v":"class=青春"},{"n":"同性","v":"class=同性"},{"n":"励志","v":"class=励志"},{"n":"人性","v":"class=人性"},{"n":"美食","v":"class=美食"},{"n":"女性","v":"class=女性"},{"n":"治愈","v":"class=治愈"},{"n":"历史","v":"class=历史"},{"n":"真人秀","v":"class=真人秀"},{"n":"脱口秀","v":"class=脱口秀"}]},
{"key":"area","name":"地区","value":[{"n":"全部","v":""},{"n":"大陆","v":"area=大陆"},{"n":"香港","v":"area=香港"},{"n":"韩国","v":"area=韩国"},{"n":"美国","v":"area=美国"},{"n":"日本","v":"area=日本"},{"n":"法国","v":"area=法国"},{"n":"英国","v":"area=英国"},{"n":"德国","v":"area=德国"},{"n":"台湾","v":"area=台湾"},{"n":"泰国","v":"area=泰国"},{"n":"印度","v":"area=印度"},{"n":"其他","v":"area=其他"}]},
{"key":"lang","name":"语言","value":[{"n":"全部","v":""},{"n":"国语","v":"lang=国语"},{"n":"英语","v":"lang=英语"},{"n":"粤语","v":"lang=粤语"},{"n":"闽南语","v":"lang=闽南语"},{"n":"韩语","v":"lang=韩语"},{"n":"日语","v":"lang=日语"},{"n":"其它","v":"lang=其它"}]},
{"key":"year","name":"年份","value":[{"n":"全部","v":""},{"n":"2024","v":"year=2024"},{"n":"2023","v":"year=2023"},{"n":"2022","v":"year=2022"},{"n":"2021","v":"year=2021"},{"n":"2020","v":"year=2020"},{"n":"2019","v":"year=2019"},{"n":"2018","v":"year=2018"},{"n":"2017","v":"year=2017"},{"n":"2016","v":"year=2016"},{"n":"2015","v":"year=2015"},{"n":"2014","v":"year=2014"},{"n":"2013","v":"year=2013"},{"n":"2012","v":"year=2012"},{"n":"2011","v":"year=2011"},{"n":"2010","v":"year=2010"},{"n":"2009","v":"year=2009"},{"n":"2008","v":"year=2008"},{"n":"2007","v":"year=2007"}]}
],
"3":[
{"key":"class","name":"剧情","value":[{"n":"全部","v":""},{"n":"Netflix","v":"class=Netflix"},{"n":"脱口秀","v":"class=脱口秀"},{"n":"真人秀","v":"class=真人秀"},{"n":"选秀","v":"class=选秀"},{"n":"八卦","v":"class=八卦"},{"n":"访谈","v":"class=访谈"},{"n":"情感","v":"class=情感"},{"n":"生活","v":"class=生活"},{"n":"晚会","v":"class=晚会"},{"n":"搞笑","v":"class=搞笑"},{"n":"音乐","v":"class=音乐"},{"n":"时尚","v":"class=时尚"},{"n":"游戏","v":"class=游戏"},{"n":"少儿","v":"class=少儿"},{"n":"体育","v":"class=体育"},{"n":"纪实","v":"class=纪实"},{"n":"科教","v":"class=科教"},{"n":"曲艺","v":"class=曲艺"},{"n":"歌舞","v":"class=歌舞"},{"n":"财经","v":"class=财经"},{"n":"汽车","v":"class=汽车"},{"n":"播报","v":"class=播报"},{"n":"其他","v":"class=其他"}]},
{"key":"area","name":"地区","value":[{"n":"全部","v":""},{"n":"大陆","v":"area=大陆"},{"n":"韩国","v":"area=韩国"},{"n":"香港","v":"area=香港"},{"n":"台湾","v":"area=台湾"},{"n":"美国","v":"area=美国"},{"n":"其它","v":"area=其它"}]},
{"key":"lang","name":"语言","value":[{"n":"全部","v":""},{"n":"国语","v":"lang=国语"},{"n":"英语","v":"lang=英语"},{"n":"粤语","v":"lang=粤语"},{"n":"闽南语","v":"lang=闽南语"},{"n":"韩语","v":"lang=韩语"},{"n":"日语","v":"lang=日语"},{"n":"其它","v":"lang=其它"}]},
{"key":"year","name":"年份","value":[{"n":"全部","v":""},{"n":"2024","v":"year=2024"},{"n":"2023","v":"year=2023"},{"n":"2022","v":"year=2022"},{"n":"2021","v":"year=2021"},{"n":"2020","v":"year=2020"},{"n":"2019","v":"year=2019"},{"n":"2018","v":"year=2018"},{"n":"2017","v":"year=2017"},{"n":"2016","v":"year=2016"},{"n":"2015","v":"year=2015"},{"n":"2014","v":"year=2014"},{"n":"2013","v":"year=2013"},{"n":"2012","v":"year=2012"},{"n":"2011","v":"year=2011"},{"n":"2010","v":"year=2010"},{"n":"2009","v":"year=2009"},{"n":"2008","v":"year=2008"},{"n":"2007","v":"year=2007"}]}
],
"4":[
{"key":"class","name":"剧情","value":[{"n":"全部","v":""},{"n":"Netflix","v":"class=Netflix"},{"n":"热血","v":"class=热血"},{"n":"科幻","v":"class=科幻"},{"n":"美少女","v":"class=美少女"},{"n":"魔幻","v":"class=魔幻"},{"n":"经典","v":"class=经典"},{"n":"励志","v":"class=励志"},{"n":"少儿","v":"class=少儿"},{"n":"冒险","v":"class=冒险"},{"n":"搞笑","v":"class=搞笑"},{"n":"推理","v":"class=推理"},{"n":"恋爱","v":"class=恋爱"},{"n":"治愈","v":"class=治愈"},{"n":"幻想","v":"class=幻想"},{"n":"校园","v":"class=校园"},{"n":"动物","v":"class=动物"},{"n":"机战","v":"class=机战"},{"n":"亲子","v":"class=亲子"},{"n":"儿歌","v":"class=儿歌"},{"n":"运动","v":"class=运动"},{"n":"悬疑","v":"class=悬疑"},{"n":"怪物","v":"class=怪物"},{"n":"战争","v":"class=战争"},{"n":"益智","v":"class=益智"},{"n":"青春","v":"class=青春"},{"n":"童话","v":"class=童话"},{"n":"竞技","v":"class=竞技"},{"n":"动作","v":"class=动作"},{"n":"社会","v":"class=社会"},{"n":"友情","v":"class=友情"},{"n":"真人版","v":"class=真人版"},{"n":"电影版","v":"class=电影版"},{"n":"OVA版","v":"class=OVA版"},{"n":"TV版","v":"class=TV版"},{"n":"新番动画","v":"class=新番动画"},{"n":"完结动画","v":"class=完结动画"}]},
{"key":"area","name":"地区","value":[{"n":"全部","v":""},{"n":"大陆","v":"area=大陆"},{"n":"日本","v":"area=日本"},{"n":"欧美","v":"area=欧美"},{"n":"其他","v":"area=其他"}]},
{"key":"lang","name":"语言","value":[{"n":"全部","v":""},{"n":"国语","v":"lang=国语"},{"n":"英语","v":"lang=英语"},{"n":"粤语","v":"lang=粤语"},{"n":"闽南语","v":"lang=闽南语"},{"n":"韩语","v":"lang=韩语"},{"n":"日语","v":"lang=日语"},{"n":"其它","v":"lang=其它"}]},
{"key":"year","name":"年份","value":[{"n":"全部","v":""},{"n":"2024","v":"year=2024"},{"n":"2023","v":"year=2023"},{"n":"2022","v":"year=2022"},{"n":"2021","v":"year=2021"},{"n":"2020","v":"year=2020"},{"n":"2019","v":"year=2019"},{"n":"2018","v":"year=2018"},{"n":"2017","v":"year=2017"},{"n":"2016","v":"year=2016"},{"n":"2015","v":"year=2015"},{"n":"2014","v":"year=2014"},{"n":"2013","v":"year=2013"},{"n":"2012","v":"year=2012"},{"n":"2011","v":"year=2011"},{"n":"2010","v":"year=2010"},{"n":"2009","v":"year=2009"},{"n":"2008","v":"year=2008"},{"n":"2007","v":"year=2007"}]}
],
"124":[
{"key":"lang","name":"语言","value":[{"n":"全部","v":""},{"n":"国语","v":"lang=国语"},{"n":"英语","v":"lang=英语"},{"n":"粤语","v":"lang=粤语"},{"n":"闽南语","v":"lang=闽南语"},{"n":"韩语","v":"lang=韩语"},{"n":"日语","v":"lang=日语"},{"n":"其它","v":"lang=其它"}]},
{"key":"year","name":"年份","value":[{"n":"全部","v":""},{"n":"2024","v":"year=2024"},{"n":"2023","v":"year=2023"},{"n":"2022","v":"year=2022"},{"n":"2021","v":"year=2021"},{"n":"2020","v":"year=2020"},{"n":"2019","v":"year=2019"},{"n":"2018","v":"year=2018"},{"n":"2017","v":"year=2017"},{"n":"2016","v":"year=2016"},{"n":"2015","v":"year=2015"},{"n":"2014","v":"year=2014"},{"n":"2013","v":"year=2013"},{"n":"2012","v":"year=2012"},{"n":"2011","v":"year=2011"},{"n":"2010","v":"year=2010"},{"n":"2009","v":"year=2009"},{"n":"2008","v":"year=2008"},{"n":"2007","v":"year=2007"}]}
]
}
}